app/controllers/books_controller.rb

def new
    @book = Book.new
      @books = Book.all
---
SELECT "books".* FROM "books"

def edit
  @book = Book.find(params[:id])
  @books = Book.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT "books".* FROM "books"

def create
    @book = Book.new(params[:book])
    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "description", "release", "language", "publishing_house", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @book = Book.find(params[:id])
    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "books" SET "publishing_house" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["publishing_house", "Nova Terra teste"], ["updated_at", "2015-10-08 19:31:38.313759"], ["id", 1]]