app/controllers/dashboard_controller.rb

SELECT COUNT(*) FROM "books"
---
 def index

 @new_books = Book.count