app/controllers/settings_controller.rb

SELECT "settings".* FROM "settings"
---
  def index
    @settings = Setting.all

UPDATE "settings" SET "url" = ?, "updated_at" = ? WHERE "settings"."id" = ?  [["url", "http://www.locateca.com.br"], ["updated_at", "2015-10-13 23:13:40.529575"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @setting.update(setting_params)

SELECT  "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_setting
      @setting = Setting.find(params[:id])